<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>This recipe downloads DiffusionBee, packages it, then uploads the pkg to your Jamf Pro Server/Distribution Point,
creates/updates the policy, and then flushes the Policy Log to initiate deployment.

The server/share details must be set using variables set in the environment or specified in your override
(see https://github.com/grahampugh/jamf-upload/wiki/JamfUploader-AutoPkg-Processors).

The grahampugh-recipes repo is required.

See the parent -latest recipe for details.
</string>
	<key>Identifier</key>
	<string>com.github.jazzace.jamf.DiffusionBee-flush</string>
	<key>Input</key>
	<dict/>
	<key>MinimumVersion</key>
	<string>2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jazzace.jamf.DiffusionBee-latest</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyLogFlusher</string>
		</dict>
	</array>
</dict>
</plist>
