<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of DiffusionBee. Since there are separate versions for
Apple Silicon and Intel, you specify which one to download using the ARCH_HQ input variable.
Currently supported values are:
arm64_MPS - Apple Silicon
arm64_TF  - Apple Silicon High Quality version
intel_MPS - Intel 64 Bit
</string>
	<key>Identifier</key>
	<string>com.github.jazzace.download.DiffusionBee</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>DiffusionBee</string>
		<key>ARCH_HQ</key>
		<string>arm64_MPS</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>https://github.com/divamgupta/diffusionbee-stable-diffusion-ui/releases/download/[\d.]+/DiffusionBee-[\d.]+-%ARCH_HQ%[SDFP\d._]+\.dmg</string>
				<key>result_output_var_name</key>
				<string>url</string>
				<key>url</key>
				<string>https://diffusionbee.com/download</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/DiffusionBee.app</string>
				<key>requirement</key>
				<string>identifier "com.linerai.liner" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "6QF6Z7X8UW"</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/DiffusionBee.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
