<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Audacity, packages it, and then copies the package to the DeployStudio packages repository.
Input keys:
- DS_NAME is what the final package will be called, regardless of what was generated by the parent recipe. If you would
prefer to use what the parent recipe generated, set DS_NAME to %NAME% (for "Audacity") or %pkgname% (for "Audacity-%version%").
- DS_PKGS_PATH is the path for the Packages folder in the DeployStudio repository (trailing slash not required/desired).
The path does not need to be on the same volume as the cache, as the pkg is being duplicated.
</string>
    <key>Identifier</key>
    <string>com.github.jazzace.ds.audacity</string>
    <key>Input</key>
    <dict>
        <key>DS_PKGS_PATH</key>
		<string>/Volumes/IAML-DSServer/Users/Shared/Deploy/Packages</string>
		<key>DS_NAME</key>
		<string>Audacity</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.scriptingosx.pkg.audacity</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>new_package_request == FALSE</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pkg_path%</string>
                <key>destination_path</key>
                <string>%DS_PKGS_PATH%/%DS_NAME%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>