<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Fetches the latest Sassafras KeyClient Mac installer package.
The executable 'k2clientconfig' is also fetched for customizing the pkg in child recipes.
Input keys:
- NAME: what you would like the client to be named
- MAJOR_VER: The major version of KeyServer you are using, expressed as two digits. 
  To use the most current version, leave a completely empty string. Otherwise, use the 
  major version without the decimal place. For example, version 7.0 would be entered as "70".
  Sassafras supports versions 6.0, 6.1, 6.2, 7.0, 7.1, and 7.2 at the time this recipe
  was created. Downloadable versions are listed on www.sassafras.com/downloads/.
</string>
    <key>Identifier</key>
    <string>com.github.jazzace.download.sassafras-k2client</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>K2Client</string>
        <key>MAJOR_VER</key>
        <string></string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://www.sassafras.com/k2/revisions%MAJOR_VER%/current/Installers/Macintosh%20Installers/Misc/k2clientconfig.zip</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://www.sassafras.com/k2/revisions%MAJOR_VER%/current/Installers/Macintosh%20Installers/Client/K2Client.pkg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
