<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
<!-- Use this template to take any parent recipe that creates a pkg using the PkgCreator processor 
and copy the package to the Packages folder inside your your DeployStudio repository.
By keeping the package name the same, your DeployStudio workflows will not care that the package contents 
may have changed, hence the default choice of using the app name for the package name.
You need to change ____ (to the core recipe name), yourgithubusername, and (in some cases) autopkg as the ParentRecipe author.
If you might want to leverage this template to auto-create a bunch of these, check Allister Banks' repo
for ideas and sample code: https://github.com/arubdesu/recipeGenerationUtils  -->
    <string>Downloads latest version of ____, packages it, and then copies the package to the DeployStudio packages repository.
Input keys:
- DS_PKGS_PATH is the path for the Packages folder in the DeployStudio repository (trailing slash not required/desired).
  The path does not need to be on the same volume as the cache, as the pkg is being duplicated.
- DS_NAME is what the final package will be called in DeployStudio, regardless of what was generated by the parent recipe.
  It defaults to %NAME% (just the app name); use %pkgname% if you want the version number appended.
</string>
    <key>Identifier</key>
    <string>com.github.yourgithubusername.ds.____</string>
    <key>Input</key>
    <dict>
        <key>DS_PKGS_PATH</key>
		<string>/Volumes/DSServer/Users/Shared/Deploy/Packages</string>
		<key>DS_NAME</key>
		<string>%NAME%</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.pkg.____</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
<!-- Depending on the processor in the parent recipe, either download_changed or new_package_request will be used to the left of the ==. -->
                <string>new_package_request == FALSE</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pkg_path%</string>
                <key>destination_path</key>
                <string>%DS_PKGS_PATH%/%DS_NAME%.pkg</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
    </array>
</dict>
</plist>