<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest VLC disk image, packages it, and then copies the package to the DeployStudio packages repository.
Input keys:
- NAME is what the final package will be called, regardless of what was generated by the parent recipe.
- DS_PKGS_PATH is the path for the Packages folder in the DeployStudio repository (trailing slash not required/desired).
The path does not need to be on the same volume as the cache, as the pkg is being duplicated.
Note that this recipe will copy the package every time it is run, even if the package has not changed.</string>
    <key>Identifier</key>
    <string>com.github.jazzace.ds.VLC</string>
    <key>Input</key>
    <dict>
        <key>DS_PKGS_PATH</key>
		<string>/Volumes/IAML-DSServer/Users/Shared/Deploy/Packages</string>
		<key>NAME</key>
		<string>VLC</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.pkg.VLC</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pkg_path%</string>
                <key>pkg_path</key>
                <string>%DS_PKGS_PATH%/%NAME%.pkg</string>
            </dict>
            <key>Processor</key>
            <string>PkgCopier</string>
        </dict>
    </array>
</dict>
</plist>