<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest release of NVivo (Version 20 or later).
This recipe requires that you have Elliot Jordan's recipes (homebysix-recipes) in your RecipeRepos,
as his VersionSplitter processor is used.
Note that if your child recipe requires the current version number, the variable "version" will
be set to the major version (e.g., 20). Use the variable "full_version" or re-fetch the value 
using a processor like AppDmgVersioner.
</string>
	<key>Identifier</key>
	<string>com.github.jazzace.download.NVivo</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>NVivo</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://download.qsrinternational.com/Software/NVivoforMac/NVivo.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.homebysix.VersionSplitter/VersionSplitter</string>
			<key>Arguments</key>
			<dict>
				<key>full_version</key>
				<string>%version%</string>
				<key>split_on</key>
				<string>.</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/*.app</string>
				<key>requirement</key>
				<string>identifier "com.qsrinternational.NVivo-%version%" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = A66L57342X</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
