<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>This recipe takes the PTGui app (contained in a disk image that you have already downloaded) and
creates an installer package for the app plus the JSON file you created containing the license keys for activation
(as per https://ptgui.com/support.html#2_10).

LIC_FILE is the path of the JSON file (this will be installed in the location required by PTGui).
You should set this value in an override or at runtime using the -k flag.

Your command to create the pkg will look something like this:

    autopkg run PTGuiVolume.pkg -p ~/Downloads/PTGui_12.11.dmg

(Substitute the actual path to your downloaded disk image.)</string>
	<key>Identifier</key>
	<string>com.github.jazzace.pkg.ptguivolume</string>
	<key>Input</key>
	<dict>
		<key>LIC_FILE</key>
		<string>/path/to/licensekey.json</string>
		<key>NAME</key>
		<string>PTGui</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.4</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PackageRequired</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%PKG%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
					<key>Users</key>
					<string>0755</string>
					<key>Users/Shared</key>
					<string>0777</string>
					<key>Users/Shared/Application Support</key>
					<string>0777</string>
					<key>Users/Shared/Application Support/PTGui</key>
					<string>0777</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Applications/%app_name%</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%PKG%/%app_name%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Users/Shared/Application Support/PTGui/licensekey.json</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%LIC_FILE%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>path</key>
							<string>Users</string>
							<key>user</key>
							<string>root</string>
						</dict>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>path</key>
							<string>Users/Shared</string>
							<key>user</key>
							<string>root</string>
						</dict>
						<dict>
							<key>group</key>
							<string>staff</string>
							<key>path</key>
							<string>Users/Shared/Application Support</string>
							<key>user</key>
							<string>root</string>
						</dict>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>%bundleid%.%NAME%</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
