<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the KeyShot package installer and gets the version number
without the build number (which is what Jamf Pro Patch Management requires).</string>
	<key>Identifier</key>
	<string>com.github.jazzace.pkg.keyshot</string>
	<key>Input</key>
	<dict/>
	<key>MinimumVersion</key>
	<string>2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jazzace.download.keyshot</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.jazzace.processors/TextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>keyshot_mac64_[\d.]+_(\d+\.\d+.\d+)\.\d+\.pkg</string>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>text_in</key>
				<string>%pathname%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
