<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of a particular major version of KeyShot for macOS.
The recipe user must determine the product download number (six digits) and set that as
the value of PRODUCT_ID in the Input dictionary. That will be found at the end of the
download link within your account. Based on what is known at the time of this writing,
the following PRODUCT_IDs match the versions listed:

370762 - 2024 (13)
357619 - 2023 (12)
354524 - 11
350990 - 10

You could also create an override of this recipe to download the KeyShot Content pkg installer
using the same principles.
</string>
	<key>Identifier</key>
	<string>com.github.jazzace.download.keyshot</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>KeyShot</string>
		<key>PRODUCT_ID</key>
		<string>370762</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.pkg</string>
				<key>url</key>
				<string>https://www.keyshot.com/download/%PRODUCT_ID%/</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Luxion, Inc (W7B24M74T3)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
