<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Takes the KeyShot package installer from the parent recipe and sets the version variable to
the version number without the build number (which is what Jamf Pro Patch Management requires for KeyShot 12/2023).

Note that Luxion has done some strange things with versioning starting with version 13/2024, where 
marketing version 2024.1 shows as 13.0.0 (build 92). Nor does Jamf Patch Management support v. 13/2024 
at the time of this writing.

Thus, this recipe is only useful for KeyShot 12/2023. This recipe will not be updated and will be
removed at a future date, so you are encouraged to write and share your own replacement recipe.
</string>
	<key>Identifier</key>
	<string>com.github.jazzace.pkg.keyshot</string>
	<key>Input</key>
	<dict/>
	<key>MinimumVersion</key>
	<string>2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jazzace.download.keyshot</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>This recipe is no longer supported. Expect it to be removed at a future date.</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.jazzace.processors/TextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>keyshot_mac64_[\d.]+_(\d+\.\d+.\d+)\.\d+\.pkg</string>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>text_in</key>
				<string>%pathname%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
