<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Flash Player for System Administrators,
extracts the package from the dmg, and then copies the package to the DeployStudio packages repository.
  
This recipe requires that you create a recipe override in order for it to work.
For FLASH_DLA_URL, use the URI to the Adobe Flash Player Distribution page from Adobe (you would have received
a link to this page when your confirmed License Agreement was e-mailed back to you).

If you wish to grab the ESR version of Flash, use my FlashPlayerDLA recipe. 
(I hope to combine these two recipes in the future once I learn enough Python to write a 
custom processor that would let you select your version based on an input value. At that 
point, this recipe will become deprecated.)

Input keys for this recipe:
   • DS_PKGS_PATH is the path for the Packages folder in the DeployStudio repository 
     (trailing slash not required/desired). The path does not need to be on the same volume
     as the cache, as the pkg is being duplicated;
   • DS_NAME is what the final package will be called in DeployStudio, regardless of 
     what was generated by the parent recipe.

The parent recipe suppresses unnecessary copying of the package using the "StopProcessingIf" 
processor. This means this recipe or any recipe that uses this as a parent recipe could stop 
execution before reaching the child. You may need to remove the cache for the recipe in question
and start again if you manually delete or move the package that this recipe creates.
</string>
    <key>Identifier</key>
    <string>com.github.jazzace.ds.FlashPlayerDLACurrent</string>
    <key>Input</key>
    <dict>
        <key>DS_PKGS_PATH</key>
		<string>/Volumes/DSServer/Users/Shared/Deploy/Packages</string>
		<key>DS_NAME</key>
		<string>%NAME%</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jazzace.pkg.FlashPlayerDLACurrent</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
                <key>destination_path</key>
                <string>%DS_PKGS_PATH%/%DS_NAME%.pkg</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
    </array>
</dict>
</plist>