<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Flash Player for System Administrators.

This recipe requires that you create a recipe override in order for it to work.

NOTE 1: If you are using this for current (non-ESR) Flash downloads, you should try 
the AdobeFlashDLACurrent recipes in this same folder, as it eliminates the need to increment 
the major version number when Adobe decides that a particular release warrants a new major version number.

NOTE 2: The development plan for the recipe with this identifier is a combined recipe where 
you will be able to specify either ESR or Current (much like you do with Firefox). It will 
be easier in that you will specify the URI Adobe provided to you (as the new DLACurrent 
recipe does) but it will probably break your current use of this recipe.

Instructions:
1. Go to the Adobe Flash Player Distribution page on Adobe's site (you would have received
a link to this page when your confirmed License Agreement was e-mailed back to you).
2. Find the link for the version that you want to download and copy that link.
(You can choose the current version or the Extended Support Release.)
3. Create an override for this recipe:
   • For FLASH_DOWNLOAD_URL_DIR, use the link you just copied (including http://) but delete 
     the .dmg file reference (we only want the directory where the .dmg is located);
   • For MAJOR_VERSION, use either 17 for the current version or 13 for the ESR version
     (Note: When Adobe updates to a new full number version, you will need to change your
     override unless someone out there would like to create a new processor that can supply
     that information — hint, hint).
</string>
    <key>Identifier</key>
    <string>com.github.jazzace.download.FlashPlayerDLA</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FlashPlayerDLA</string>
        <key>FLASH_DOWNLOAD_URL_DIR</key>
        <string>http://youneed.to/override/this</string> 
        <key>MAJOR_VERSION</key>
        <string>13</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
         <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%FLASH_DOWNLOAD_URL_DIR%/install_flash_player_%MAJOR_VERSION%_osx_pkg.dmg</string>
            </dict>
        </dict>
	</array>
</dict>
</plist>