<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Flash Player for System Administrators and installs it.
  
This recipe requires that you create a recipe override in order for it to work.
Instructions:
1. Go to the Adobe Flash Player Distribution page on Adobe's site (you would have received
a link to this page when your confirmed License Agreement was e-mailed back to you).
2. Find the link for the version that you want to download and copy that link.
(You can choose the current version or the Extended Support Release.)
3. Create an override for this recipe:
   • For FLASH_DOWNLOAD_URL_DIR, use the link you just copied (including http://) but delete 
     the .dmg file reference (we only want the directory where the .dmg is located);
   • For MAJOR_VERSION, use either 16 for the current version or 13 for the ESR version
     (Note: When Adobe updates to a new full number version, you will need to change your
     override unless someone out there would like to create a new processor that can supply
     that information — hint, hint);
</string>
    <key>Identifier</key>
    <string>com.github.jazzace.install.FlashPlayerDLA</string>
    <key>Input</key>
    <dict/>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jazzace.download.FlashPlayerDLA</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
            <key>Arguments</key>
            <dict/>
                <key>pkg_path</key>
                <string>%pathname%/*.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>