<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Flash Player for System Administrators and installs it.
  
This recipe requires that you create a recipe override in order for it to work.
For FLASH_DLA_URL, use the URI to the Adobe Flash Player Distribution page from Adobe (you would have received
a link to this page when your confirmed License Agreement was e-mailed back to you).

This recipe only works for URIs from Adobe that contain "distribution4". See the ReadMe 
in this folder for newer license renewals (Oct. 2016 and later).
</string>
    <key>Identifier</key>
    <string>com.github.jazzace.install.FlashPlayerDLACurrent</string>
    <key>Input</key>
    <dict/>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jazzace.download.FlashPlayerDLACurrent</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%/*.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>