<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Flash Player for System Administrators
and extracts the package from the dmg.

This recipe requires that you create a recipe override in order for it to work.
For FLASH_DLA_URL, use the URI to the Adobe Flash Player Distribution page from Adobe (you would have received
a link to this page when your confirmed License Agreement was e-mailed back to you).

This recipe only works for URIs from Adobe that contain "distribution4". See the ReadMe 
in this folder for newer license renewals (Oct. 2016 and later).

This recipe suppresses unnecessary copying of the package using the "StopProcessingIf" 
processor. This means that any recipe that uses this as a parent recipe could stop execution 
before reaching the child. You may need to remove the cache for the recipe in question and 
start again if you manually delete or move the package that this recipe creates.

The NAME input key specified in the parent recipe is what the package will be named
(of course, you can choose to change that in the override).
</string>
    <key>Identifier</key>
    <string>com.github.jazzace.pkg.FlashPlayerDLACurrent</string>
    <key>Input</key>
    <dict/>
    <key>ParentRecipe</key>
    <string>com.github.jazzace.download.FlashPlayerDLACurrent</string>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == FALSE</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/*.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
    </array>
</dict>
</plist>
