<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Flash Player for System Administrators,
extracts the package from the dmg, and then copies the package to the DeployStudio packages repository.
  
This recipe requires that you create a recipe override in order for it to work.
Instructions:
1. Go to the Adobe Flash Player Distribution page on Adobe's site (you would have received
a link to this page when your confirmed License Agreement was e-mailed back to you).
2. Find the link for the version that you want to download and copy that link.
(You can choose the current version or the Extended Support Release.)
3. Create an override for this recipe:
   • For FLASH_DOWNLOAD_URL_DIR, use the link you just copied (including http://) but delete 
     the .dmg file reference (we only want the directory where the .dmg is located);
   • For MAJOR_VERSION, use either 17 for the current version or 13 for the ESR version
     (Note: When Adobe updates to a new full number version, you will need to change your
     override unless someone out there would like to create a new processor that can supply
     that information — hint, hint);
   • DS_PKGS_PATH is the path for the Packages folder in the DeployStudio repository 
     (trailing slash not required/desired). The path does not need to be on the same volume
     as the cache, as the pkg is being duplicated;
   • DS_NAME is what the final package will be called in DeployStudio, regardless of 
     what was generated by the parent recipe.

The parent recipe suppresses unnecessary copying of the package using the "StopProcessingIf" 
processor. This means this recipe or any recipe that uses this as a parent recipe could stop 
execution before reaching the child. You may need to remove the cache for the recipe in question
and start again if you manually delete or move the package that this recipe creates.
</string>
    <key>Identifier</key>
    <string>com.github.jazzace.ds.FlashPlayerDLA</string>
    <key>Input</key>
    <dict>
        <key>DS_PKGS_PATH</key>
		<string>/Volumes/DSServer/Users/Shared/Deploy/Packages</string>
		<key>DS_NAME</key>
		<string>%NAME%</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jazzace.pkg.FlashPlayerDLA</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
                <key>destination_path</key>
                <string>%DS_PKGS_PATH%/%DS_NAME%.pkg</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
    </array>
</dict>
</plist>