<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Lightwright.
This recipe supports version 6.0.40 and later. 
</string>
	<key>Identifier</key>
	<string>com.github.jazzace.download.lightwright</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Lightwright</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>"softwareUrlMac":"([^"]+)"</string>
				<key>result_output_var_name</key>
				<string>url</string>
				<key>url</key>
				<string>https://www.lightwright.com/api/web/public/download/getLinks</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Lightwright*.app</string>
				<key>requirement</key>
				<string>identifier "com.mckernon.lightwright6" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "6SCCLKDYL2"</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
