<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current version of Amadeus Pro and creates a pkg installer.
This recipe is a stub, as it has been superseded by AmadeusPro.pkg.</string>
	<key>Identifier</key>
	<string>com.github.jazzace.pkg.AmadeusPro2</string>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jazzace.pkg.AmadeusPro</string>
</dict>
</plist>
