<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current version of Amadeus Pro.</string>
	<key>Identifier</key>
	<string>com.github.jazzace.download.AmadeusPro</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Amadeus Pro</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>Page</key>
				<string>pro.html</string>
				<key>Product</key>
				<string>Pro2</string>
				<key>re_pattern</key>
				<string>"btn_dload"&gt;&lt;a href="(http[s]*://[^/]*/Amadeus%Product%/Amadeus[^.]*\.zip)</string>
				<key>result_output_var_name</key>
				<string>url</string>
				<key>url</key>
				<string>https://www.hairersoft.com/%Page%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/*.app</string>
				<key>requirement</key>
				<string>identifier "com.HairerSoft.AmadeusPro" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = FWDH9W45C2</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
