<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current version of Amadeus Pro and creates a pkg installer.</string>
	<key>Identifier</key>
	<string>com.github.jazzace.pkg.AmadeusPro</string>
	<key>Input</key>
	<dict/>
	<key>MiniumumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jazzace.download.AmadeusPro</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/*.app</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
