<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the Final Cut Pro (Supplemental) Content provided by Apple.
</string>
	<key>Identifier</key>
	<string>com.github.jazzace.download.FCPContent</string>
	<key>Input</key>
	<dict>
		<key>ARTICLE_NUMBER</key>
		<string>106574</string>
		<key>NAME</key>
		<string>FCPContent</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jazzace.download.AppleSupportContent</string>
</dict>
</plist>
