<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>This recipe downloads the Final Cut Pro Content package installer and extracts it
from the disk image, renaming it NAME-version.pkg (specify NAME in the Input Variables),
</string>
	<key>Identifier</key>
	<string>com.github.jazzace.pkg.FCPContent</string>
	<key>Input</key>
	<dict>
		<key>ARTICLE_NUMBER</key>
		<string>106574</string>
		<key>NAME</key>
		<string>FCPContent</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jazzace.download.AppleSupportContent</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PkgCopier</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>source_pkg</key>
				<string>%pathname%/*.pkg</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
