<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of the Final Cut Pro X Supplemental Content, extracts the package from the dmg,
and then copies it to a local path of your choosing.
    
This recipe suppresses unnecessary copying of the package using the "StopProcessingIf" 
processor. This means that any recipe that uses this as a parent recipe could stop execution 
before reaching the child. You may need to remove the cache for the recipe in question and 
start again if you manually delete or move the package that this recipe copies by extraction.

*** Note: The parent recipe requires an external processor. You must have Nate Felton's recipe repo
    available in your cache: com.github.autopkg.n8felton-recipes ***

DS_PKGS_PATH is the destination path for the copy. A trailing slash is not required/desired.
NAME will be used to name the copied pkg.
</string>
	<key>Identifier</key>
	<string>com.github.jazzace.ds.FCPContent</string>
	<key>Input</key>
	<dict>
		<key>DS_PKGS_PATH</key>
		<string>/Volumes/DSServer/Users/Shared/Deploy/Packages</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jazzace.download.FCPContent</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>download_changed == FALSE</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%DS_PKGS_PATH%/%NAME%.pkg</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%pathname%/*.pkg</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
