<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest update of the Pro Video Formats provided by Apple for their pro apps.
    
*** Note 1: This Recipe requires an external processor. You must have Nate Felton's recipe repo
    available in your cache: com.github.autopkg.n8felton-recipes ***
*** Note 2: The downloaded installer is an updater that requires that you have one of the following installed:
    * Final Cut Pro X
    * Compressor 4.1
    * Motion 4.0 or later
    Having that software installed means you also agreed to the appropriate Software License Agreement(s).
    Version 2.0.5 and later requires OS X 10.11 or a later version of macOS. ***    
    </string>
    <key>Identifier</key>
    <string>com.github.jazzace.download.ProVideoFormats</string>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ProVideoFormats</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>com.github.n8felton.shared/AppleSupportDownloadInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>ARTICLE_NUMBER</key>
                <string>1947</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/ProVideoFormats.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Software Update</string>
                    <string>Apple Software Update Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>