<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the Pro Video Formats provided by Apple for their pro apps.
    
Note: The downloaded installer is an updater that requires that you have one of the following installed:
    * Final Cut Pro
    * Compressor
    * Motion
Having that software installed means you also agreed to the appropriate Software License Agreement(s).
    </string>
	<key>Identifier</key>
	<string>com.github.jazzace.download.ProVideoFormats</string>
	<key>Input</key>
	<dict>
		<key>ARTICLE_NUMBER</key>
		<string>106526</string>
		<key>NAME</key>
		<string>ProVideoFormats</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jazzace.download.AppleSupportContent</string>
</dict>
</plist>
