<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of the Pro Video Formats (previously known as ProApps QuickTime Codecs)
    provided by Apple for their pro apps, extracts the package from the dmg, and
    copies it to a local path of your choosing.

This recipe suppresses unnecessary copying of the package using the "StopProcessingIf"
processor. This means that any recipe that uses this as a parent recipe could stop execution
before reaching the child. You may need to remove the cache for the recipe in question and
start again if you manually delete or move the package that this recipe copies by extraction.

*** Note 1: This Recipe requires an external processor. You must have Nate Felton's recipe repo
    available in your cache: com.github.autopkg.n8felton-recipes ***
*** Note 2: The pkg installer is an updater that requires that you have one of the following installed:
    * Final Cut Pro 7 or later (including X)
    * Compressor 3.5 or later
    * Motion 4.0 or later
    Having that software installed means you also agreed to the appropriate Software License Agreement(s). ***

Normally, we would use the related .pkg recipe as a parent and copy the file to our
local repo, but the way in which AutoPkg evaluates variables means that we cannot have a .pkg
recipe that copies the package to the AutoPkg cache or to a desired path using an input
variable. So this recipe is identical to the .pkg version except that a destination
path is included in the Input keys.

The NAME input key is specified in the parent recipe. Use an override if you want something
other than the default.
</string>
	<key>Identifier</key>
	<string>com.github.jazzace.ds.ProVideoFormats</string>
	<key>Input</key>
	<dict>
		<key>DS_PKGS_PATH</key>
		<string>/Volumes/DSServer/Users/Shared/Deploy/Packages</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jazzace.download.ProVideoFormats</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>download_changed == FALSE</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%DS_PKGS_PATH%/%NAME%.pkg</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%pathname%/*.pkg</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
