<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Fetches the latest Sassafras K2 Mac installer (specified by PRODUCT) and copies it to a local/mounted drive.
This could be useful for setting up your own Client Self-updates server.

This recipe supports KeyClient 7.0 and up only. See SassafrasK2.download
for details on the REVISION Input variable, which you may wish to override.

Local Input keys:
- DS_PKGS_PATH is the path to the folder where you would like to locate the copied package (trailing slash not required/desired).
  The path does not need to be on the same volume as the cache, as the pkg is being duplicated.
- DS_NAME is what the final package will be called, regardless of what was generated by the parent recipe.
  It defaults to K2%PRODUCT%-Self-Updates (e.g., K2Client-Self-Updates).

</string>
    <key>Identifier</key>
    <string>com.github.jazzace.ds.sassafrasK2product</string>
    <key>Input</key>
    <dict>
        <key>DS_PKGS_PATH</key>
        <string>/Volumes/DSServer/Users/Shared/Deploy/Packages</string>
        <key>DS_NAME</key>
        <string>K2%PRODUCT%-Self-Updates</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jazzace.download.sassafrasK2product</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == FALSE</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%DS_PKGS_PATH%/%DS_NAME%.pkg</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
    </array>
</dict>
</plist>
