<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Fetches the latest Sassafras K2 Mac installer for versions 7.0-7.6 specified by PRODUCT.

For versions 7.7 and later, use the new SassafrasClient/Admin/Server recipes.

REVISION is the major version without a decimal, for example:
7.0: 70
7.1: 71
7.2: 72
7.5: 75

This recipe supports only a REVISION of 70 through 76. If REVISION
is set to an empty string, the 7.6 version will be retrieved.

PRODUCT must be one of the following:
Admin
Server
Client

If you want to download more than one (e.g., both Admin and Server),
make an override for each and specify a unique identifier using the -n option
(e.g., autopkg make-override SassafrasK2.download -n SassafrasK2Server.download).

</string>
	<key>Identifier</key>
	<string>com.github.jazzace.download.sassafrasK2product</string>
	<key>Input</key>
	<dict>
		<key>PRODUCT</key>
		<string>Admin</string>
		<key>REVISION</key>
		<string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>This recipe does not work with version 7.7 of the product or later — please use the new SassafrasAllSight recipes. Expect this recipe to be removed at a future date.</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.sassafras.com/k2/revisions%REVISION%/current/Installers/Macintosh%20Installers/%PRODUCT%/K2%PRODUCT%.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Sassafras Software, Inc. (7Z2KSDFMVY)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
