<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of Sibelius, extracts the package installer, and then
copies the package to a local path of your choosing.

Input keys:
- DS_PKGS_PATH is the destination path for the copy. A trailing slash is not required/desired.
  The path does not need to be on the same volume as the cache, as the pkg is being duplicated.
- DS_NAME is what the final package will be called, regardless of what was generated by the parent recipe.
  It defaults to %NAME% (just the app name).

Note: The parent recipe suppresses unnecessary copying of the package using the "StopProcessingIf" processor.
You may need to remove the cache for this recipe and start again if you manually delete or move
the package that this recipe copies.

</string>
	<key>Identifier</key>
	<string>com.github.jazzace.ds.Sibelius</string>
	<key>Input</key>
	<dict>
		<key>DS_NAME</key>
		<string>%NAME%</string>
		<key>DS_PKGS_PATH</key>
		<string>/Volumes/DSServer/Users/Shared/Deploy/Packages</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jazzace.pkg.Sibelius</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%DS_PKGS_PATH%/%DS_NAME%.pkg</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
