<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of the MS Office 2011 updater, packages it, and then copies the package to the DeployStudio packages repository.
Input keys:
- NAME is the name desired to be used in the parent recipe (although it seems to have no effect in this case).
- VERSION: "latest" or a specific version number to download that version instead.
- CULTURE_CODE sets the localization (0409 by default). See
  http://msdn.microsoft.com/en-us/library/ee825488(v=cs.20).aspx for a table of Culture Codes.
- DS_PKGS_PATH is the path for the Packages folder in the DeployStudio repository (trailing slash not required/desired).
  The path does not need to be on the same volume as the cache, as the pkg is being duplicated.
- DS_NAME is what the final package will be called in DeployStudio, regardless of what was generated by the parent recipe.
  It defaults to %NAME% (as specified earlier); use %pkgname% if you want the version number included.
</string>
    <key>Identifier</key>
    <string>com.github.jazzace.ds.Office2011Updates</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Office2011_update</string>
        <key>VERSION</key>
        <string>latest</string>
        <key>CULTURE_CODE</key>
        <string>0409</string>
        <key>DS_PKGS_PATH</key>
		<string>/Volumes/DSServer/Users/Shared/Deploy/Packages</string>
		<key>DS_NAME</key>
		<string>%NAME%</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.pkg.Office2011Updates</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == FALSE</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pkg_path%</string>
                <key>destination_path</key>
                <string>%DS_PKGS_PATH%/%DS_NAME%.pkg</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
    </array>
</dict>
</plist>