<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Thanks to Recipe Robot v2.3.1 (https://github.com/homebysix/recipe-robot) for the assist.</string>
	<key>Description</key>
	<string>Downloads the latest release of LocalSend from GitHub.</string>
	<key>Identifier</key>
	<string>com.github.jazzace.download.LocalSend</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>LocalSend</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>.*\.dmg$</string>
				<key>github_repo</key>
				<string>localsend/localsend</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/LocalSend.app</string>
				<key>requirement</key>
				<string>identifier "org.localsend.localsendApp" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "3W7H4PYMCV"</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
