<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest release of the Stable Diffusion WebUI code from the 
AUTOMATIC1111 GitHub project. No code signature is possible, hence its omission.</string>
	<key>Identifier</key>
	<string>com.github.jazzace.download.StableDiffusionWebUI</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>StableDiffusionWebUI</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>/AUTOMATIC1111/stable-diffusion-webui/releases/tag/v([\d.]+)"</string>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>url</key>
				<string>https://github.com/AUTOMATIC1111/stable-diffusion-webui/releases</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://github.com/AUTOMATIC1111/stable-diffusion-webui/archive/refs/tags/v%version%.zip</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
