<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>This recipe takes the ZBrush volume license installer app that you have already downloaded and
creates a package that leverages the silent install CLI method to automate installation. Additionally, the
postinstall script adds the volume licensing files (specific to your installation, provided by Pixologic)
and a modified DefaultZScript.txt file (e.g., to keep ZHomePage from starting at launch every time)
to the correct locations in the application's directories.
This version of the recipe supports ZBrush 2021.5 and later and requires the homebysix-recipes repo.

Input Variables of note:
• LIC_FILES_DIR is the path to the local *directory* that holds the volume licensing files
  (license_ZBrush*_1seat.lic and FloatingLicenseDLL.lib will be used);
• ZSCRIPT_FILE is the path to the *file* you wish to use for DefaultZScript.txt
  (a sample file that suppresses the launch of ZHomePage upon opening the app is included in
  the repo for this recipe).

Once the input variables are set (likely in an override), your command to create the pkg will
look something like this:

    autopkg run ZBrushVolume.pkg -p ~/Downloads/ZBrush_2022.0.5_FL_Installer.dmg

(Substitute the actual path to your downloaded disk image.)</string>
	<key>Identifier</key>
	<string>com.github.jazzace.pkg.zbrushvolume</string>
	<key>Input</key>
	<dict>
		<key>LIC_FILES_DIR</key>
		<string>/path/to/ZBrush - YourInstitution</string>
		<key>NAME</key>
		<string>ZBrush</string>
		<key>ZSCRIPT_FILE</key>
		<string>/path/to/DefaultZScript.txt</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.4</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PackageRequired</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%PKG%</string>
			</dict>
			<key>Comment</key>
			<string>The "version" that this processor extracts is the major version,
			which is used as the name of the parent folder in /Applications (e.g., 2021 FL).
			The 2 FindAndReplace processor calls that follow extract the current version number
			from the installer app name (e.g., 2021.6) and store it in the variable "output_string".</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.homebysix.FindAndReplace/FindAndReplace</string>
			<key>Arguments</key>
			<dict>
				<key>find</key>
				<string>ZBrush_</string>
				<key>input_string</key>
				<string>%app_name%</string>
				<key>replace</key>
				<string></string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.homebysix.FindAndReplace/FindAndReplace</string>
			<key>Arguments</key>
			<dict>
				<key>find</key>
				<string>_FL_Installer.app</string>
				<key>input_string</key>
				<string>%output_string%</string>
				<key>replace</key>
				<string></string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>private</key>
					<string>0777</string>
					<key>private/tmp</key>
					<string>0777</string>
					<key>private/tmp/zbrush</key>
					<string>0777</string>
					<key>private/tmp/zbrush/vl</key>
					<string>0777</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/private/tmp/zbrush/%app_name%</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%PKG%/%app_name%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/private/tmp/zbrush/vl</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%LIC_FILES_DIR%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/private/tmp/zbrush/vl/DefaultZScript.txt</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%ZSCRIPT_FILE%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/scripts</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileCreator</string>
			<key>Arguments</key>
			<dict>
				<key>file_content</key>
				<string>#!/bin/sh
# Installs ZBrush using its command line mode.
# This is intended to be a postinstall script for a pkg that:
# • copies the installer .app to ${instpathroot}
# • copies the .lic and .lib files needed to use the licence server to $liblicfolder
# • copies a modified version of DefaultZScript.txt to $liblicfolder
#
# Assign the version number found on the parent folder in /Applications to vers,
# then extract just the year to yr
vers="%version%"
yr=${vers:0:4}
instpathroot="$3/private/tmp/zbrush"
liblicfolder="$instpathroot/vl"
# Remove old install of same major version, if present, as per Pixologic recommendation:
if [ -e "/Applications/ZBrush ${vers}/ZBrush.app" ] ; then
    echo "Uninstalling an earlier version of ZBrush ${vers}..."
    "/Applications/ZBrush ${vers}/Uninstall/Uninstall ZBrush ${yr}.app/Contents/MacOS/installbuilder.sh" --mode unattended
fi
# Main Install: (note that installer names sometimes change underscores to spaces and vice versa between versions; keep an eye out when updating)
"${instpathroot}/%app_name%/Contents/MacOS/installbuilder.sh" --mode unattended
#
# Copy files to make Floating Licence work:
cp $liblicfolder/*_1seat.lic "/Applications/ZBrush ${vers}/Licenses/"
cp $liblicfolder/FloatingLicenseDLL.lib "/Applications/ZBrush ${vers}/ZData/ZPlugs64/RLM/"
# Copy fix to keep ZHomePage from starting at launch every time
cp $liblicfolder/DefaultZScript.txt "/Applications/ZBrush ${vers}/ZScripts/"
# Get rid of the installer items if installation of main app confirmed:
if [ -e "/Applications/ZBrush ${vers}/ZBrush.app" ] ; then
    rm -R "${instpathroot:?}"
else
    echo "The expected app path (/Applications/ZBrush ${vers}/ZBrush.app) was not found after the installer script finished."
    exit 1
fi
exit 0
</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/scripts/postinstall</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>mode</key>
							<string>0777</string>
							<key>path</key>
							<string>private/tmp/zbrush/</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>%bundleid%.%NAME%</string>
					<key>pkgname</key>
					<string>%NAME%-%output_string%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<key>scripts</key>
					<string>%RECIPE_CACHE_DIR%/scripts</string>
					<key>version</key>
					<string>%output_string%</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<string>%RECIPE_CACHE_DIR%/scripts</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
