<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the Alberta COVID-19 Data page and date stamps it using the date at the 
top of the web page (the last date of full results). Designed to run daily.
This saves the web page and the following 4 data sets: Case, Summary, Geospatial, and Vaccine.
Input Keys:
    SAVE_LOCATION is the path to the directory where the web page should be copied. The path must exist.
    PAGE_NAME_PREFIX is the text (if any) that will precede the datestamp in the (copied) filename.
</string>
	<key>Identifier</key>
	<string>com.github.jazzace.download.abcovid19</string>
	<key>Input</key>
	<dict>
		<key>PAGE_NAME_PREFIX</key>
		<string>Alberta COVID-19 Data </string>
		<key>SAVE_LOCATION</key>
		<string>/Users/Shared/Alberta-COVID-19</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.alberta.ca/stats/covid-19-alberta-statistics.htm</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>goa-last-updated\" data-time-system=\"([\d-]{10})</string>
				<key>result_output_var_name</key>
				<string>stats_date</string>
				<key>url</key>
				<string>file://%pathname%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%SAVE_LOCATION%/%PAGE_NAME_PREFIX%%stats_date%.html</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.alberta.ca/data/stats/covid-19-alberta-statistics-summary-data.csv</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%SAVE_LOCATION%/%PAGE_NAME_PREFIX%Summary %stats_date%.csv</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.alberta.ca/data/stats/covid-19-alberta-statistics-map-data.csv</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%SAVE_LOCATION%/%PAGE_NAME_PREFIX%Geospatial %stats_date%.csv</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.alberta.ca/data/stats/lga-coverage.csv</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%SAVE_LOCATION%/%PAGE_NAME_PREFIX%Vaccine %stats_date%.csv</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/downloads</string>
				</array>
			</dict>
			<key>Comment</key>
			<string>Force fresh download of page every run.</string>
		</dict>
	</array>
</dict>
</plist>
