<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Takes the file specified by the --pkg (or -p) run option and builds a package for use with outset
that has a Login-Once override, then uploads the pkg to your Jamf Pro Server/Distribution Point and 
creates/updates the policy that deploys it, then flushes the log to ensure prompt installation.

The server/share details must be set using variables set in the environment or specified in your override
(see https://github.com/grahampugh/jamf-upload/wiki/JamfUploader-AutoPkg-Processors).

The following repos are required: grahampugh-recipes, robperc-recipes, and homebysix-recipes

See the parent -latest recipe for details.
</string>
	<key>Identifier</key>
	<string>com.github.jazzace.jamf.OutsetLoginOverridePkgReqd-flush</string>
	<key>Input</key>
	<dict/>
	<key>MinimumVersion</key>
	<string>2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jazzace.jamf.OutsetLoginOverridePkgReqd-latest</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyLogFlusher</string>
		</dict>
	</array>
</dict>
</plist>
