<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest packaged release of appleloops and then copies the package to 
a local path of your choosing (usually the Packages folder in the DeployStudio repository).
This recipe requires the novaksam-recipes repo.
Input keys:
- DS_PKGS_PATH is the destination path for the copy (usually /path/to/DeployStudioRepo/Packages).
  A trailing slash is not required/desired. The path does not need to be on the same volume as the cache.
- DS_NAME is what the final package will be called, regardless of what was generated by the parent recipe.
  It defaults to %NAME% (just the app name); use %pkgname% if you want what the pkg recipe generated
  (which, by convention, would have a version number appended in most cases).
</string>
    <key>Identifier</key>
    <string>com.github.jazzace.ds.appleLoops</string>
    <key>Input</key>
    <dict>
        <key>DS_PKGS_PATH</key>
        <string>/Volumes/DSServer/Users/Shared/Deploy/Packages</string>
        <key>DS_NAME</key>
        <string>%NAME%</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>ParentRecipe</key>
    <string>com.github.novaksam.pkg.appleLoops</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%DS_PKGS_PATH%/%DS_NAME%.pkg</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
    </array>
</dict>
</plist>