<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest release of customdisplayprofiles from GitHub.
No code signature is possible, hence its omission.
You must specify the ARCHITECTURE: intel or applesilicon.</string>
	<key>Identifier</key>
	<string>com.github.jazzace.download.customdisplayprofiles</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>customdisplayprofiles</string>
		<key>ARCHITECTURE</key>
		<string>applesilicon</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>tag/v([\d.]+)</string>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>url</key>
				<string>https://github.com/timsutton/customdisplayprofiles/releases</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://github.com/timsutton/customdisplayprofiles/releases/download/v%version%/customdisplayprofiles-%ARCHITECTURE%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
