<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the most recent update for Finale as a Zip archive (via Sparkle).</string>
    <key>Identifier</key>
    <string>com.github.jazzace.download.FinaleUpdate</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Finale Update</string>
        <key>SPARKLE_FEED_URL</key>
        <string>https://downloads2.makemusic.com/xml/Finale_Mac.xml</string>
	</dict>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>This recipe has been deprecated, as it does not reliably work with versions of Finale after 2014.
Expected it to be removed at a future date.</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>%SPARKLE_FEED_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
