<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download TouchOSC Editor and create a package of just the app itself.</string>
	<key>Identifier</key>
	<string>com.github.jazzace.pkg.TouchOSCEditor</string>
	<key>Input</key>
	<dict/>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jazzace.download.TouchOSCEditor</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>app_path</key>
                <string>%RECIPE_CACHE_DIR%/Unarchived/touchosc-editor-%version%-macos/TouchOSC Editor.app</string>
                <key>overwrite</key>
                <true/>
            </dict>
		</dict>
	</array>
</dict>
</plist>
