<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest PreBeta version of MDS (a.k.a. Mac Deploy Stick).</string>
	<key>Identifier</key>
	<string>com.github.jazzace.download.MDSPreBeta</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MDS</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>href="(/twocanoes/macdeploystick/downloads/PreBeta-MDS_Build-[\d]+_Version-[\d.]+dmg)</string>
				<key>url</key>
				<string>https://bitbucket.org/twocanoes/macdeploystick/downloads/</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://bitbucket.org%match%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Twocanoes Software, Inc. (UXP6YEHSPW)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%/MDS.pkg</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
