<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of i1 Profiler and verifies the code signature
of the pkg intaller inside the zip archive downloaded.

Requires the homebysix-recipes repo.
</string>
	<key>Identifier</key>
	<string>com.github.jazzace.download.i1profiler</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>i1Profiler</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>SparkleUpdateInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>appcast_url</key>
				<string>https://downloads.xrite.com/Downloads/Autoupdate/i1profiler_mac_appcast.xml</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.homebysix.FindAndReplace/FindAndReplace</string>
			<key>Arguments</key>
			<dict>
				<key>find</key>
				<string>http:</string>
				<key>input_string</key>
				<string>%url%</string>
				<key>replace</key>
				<string>https:</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%output_string%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: X-Rite, Incorporated (2K7GT73B4R)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/*.pkg</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
