<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Fetches the latest Sassafras KeyClient Mac installer and imports into
DeployStudio. Additionally, fetches the k2clientconfig tool from the Sassafras website
for the purposes of customizing the installer.

This is an adaptation of the Munki recipe (written by Tim Sutton, in the main AutoPkg 
recipes repo). The main AutoPkg recipes must be installed in order to use the 
SassafrasK2ClientCustomizer processor.

This recipe supports KeyClient 7.0 and up only. See SassafrasK2Client.download
for details on the REVISION Input variable, which you may wish to override.

Local Input keys:
- K2CLIENTCONFIG_OPTIONS is a string that should be overridden with command-line
  options to the 'k2clientconfig' tool. No sanity checking is performed beyond
  what's done by k2clientconfig. The recipe includes one suggested default, more
  documentation here:
    http://www.sassafras.com/hrl/7.2/k2clientconfigM.html
- DS_PKGS_PATH is the path for the Packages folder in the DeployStudio repository (trailing slash not required/desired).
  The path does not need to be on the same volume as the cache, as the pkg is being duplicated.
- DS_NAME is what the final package will be called in DeployStudio, regardless of what was generated by the parent recipe.
  It defaults to %NAME% (just the app name from the Parent Recipe).

There are k2clientconfig options to kill KeyAccess before installation, and to
start it after installation, implying we might not necessarily need a logout.
Some testing shows that when these options are used, the installation is still
not in a consistent state. Requiring a restart seems the only sane choice for now,
but it should be further investigated.

Sassafras uses two decimals in their pkg versions (skipping the third) but
uses three decimals everywhere else (webpage, actual bundle files, preference
pane, etc.), so we use the three-decimal version.
</string>
    <key>Identifier</key>
    <string>com.github.jazzace.ds.sassafras-k2client</string>
    <key>Input</key>
    <dict>
        <key>K2CLIENTCONFIG_OPTIONS</key>
        <string>-h 136.159.206.7 -s 2 -g no -c no -k no -r no -b no -l yes -f 0 -z comp</string>
        <key>DS_PKGS_PATH</key>
        <string>/Volumes/DSServer/Users/Shared/Deploy/Packages</string>
        <key>DS_NAME</key>
        <string>%NAME%</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.sassafras-k2client</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == FALSE</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%DS_PKGS_PATH%/%DS_NAME%.pkg</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://www.sassafras.com/k2/revisions72/current/Installers/Macintosh%20Installers/Misc/k2clientconfig</string>
                <key>download_dir</key>
                <string>%RECIPE_CACHE_DIR%/k2clientconfig</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>SassafrasK2ClientCustomizer</string>
            <key>Arguments</key>
            <dict>
                <key>base_pkg_path</key>
                <string>%DS_PKGS_PATH%/%DS_NAME%.pkg</string>
                <key>k2clientconfig_options</key>
                <string>%K2CLIENTCONFIG_OPTIONS%</string>
                <key>k2clientconfig_path</key>
                <string>%RECIPE_CACHE_DIR%/k2clientconfig/k2clientconfig</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
