<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>This recipe packages a local App Store app (specified in the override) and then uploads the pkg 
to your Jamf Pro Server/Distribution Point using variables set in the environment.
The grahampugh-recipes and nmcspadden-recipes repos are required. 
Note that the CATEGORY specified must exist on the server, otherwise the recipe will fail.
(For further details on setting the server/share details, see https://github.com/grahampugh/jamf-upload/wiki/JamfUploader-AutoPkg-Processors.)
</string>
	<key>Identifier</key>
	<string>com.github.jazzace.jamf.appstore</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Apple</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.nmcspadden.pkg.appstore</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_category</key>
				<string>%CATEGORY%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
