<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>This recipe takes the BBEdit pkg installer from the parent recipe, uploads the pkg to your Jamf Pro
Server/Distribution Point and creates/updates the policy that deploys it.

The server/share details must be set using variables set in the environment or specified in your override
(see https://github.com/grahampugh/jamf-upload/wiki/JamfUploader-AutoPkg-Processors).

The grahampugh-recipes repo is required.

Note that the (Package) CATEGORY and POLICY_CATEGORY specified by the Input variables
must each exist on the server, otherwise the recipe will fail. The value for SITE is
requested in the Input dictionary so that it may be used within the POLICY_TEMPLATE specified.
</string>
	<key>Identifier</key>
	<string>com.github.jazzace.jamf.BBEdit-latest</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Applications</string>
		<key>POLICY_CATEGORY</key>
		<string>%CATEGORY%</string>
		<key>POLICY_NAME</key>
		<string>%SITE% %NAME% Latest</string>
		<key>POLICY_TEMPLATE</key>
		<string>Policy-install-latest-site-all.xml</string>
		<key>SITE</key>
		<string>IAML</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.pkg.BBEdit</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_category</key>
				<string>%CATEGORY%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>pkg_uploaded == False</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
			<key>Arguments</key>
			<dict>
				<key>policy_name</key>
				<string>%POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>replace_policy</key>
				<string>True</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
