<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of the Epson SureColor P-series product driver from Epson's site, 
extracts the package from the dmg, and copies it to a local path of your choosing.
These will generally be drivers and ICC profiles not included in the OS by Apple.
Make separate overrides for each printer you may want. An override is required.

When Epson was using separate code signing authorities for older and new products, it was
necessary to have separate recipes (EpsonProDrivers and EpsonSureColorDrivers). Now that 
Epson is using the same authority for all new releases, this recipe has been turned into a stub
recipe that points to EpsonProDrivers.download.

If you are creating a new override, use the EpsonProDrivers series of recipes.
</string>
	<key>Identifier</key>
	<string>com.github.jazzace.ds.EpsonSureColorDrivers</string>
	<key>Input</key>
	<dict>
		<key>DS_NAME</key>
		<string>%NAME%</string>
		<key>DS_PKGS_PATH</key>
		<string>/Volumes/DSServer/Users/Shared/Deploy/Packages</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jazzace.ds.EpsonProDrivers</string>
</dict>
</plist>
