<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the Epson product driver from Epson's site.
These will generally be drivers for professional printers and the like not included in
the drivers supplied by Apple.
Make separate overrides for each device driver you may want. An override is required.

IMPORTANT:
This recipe requires that you find the support page for your product and copy that URL for
use as the base string for the SEARCH_URL key in your override. In order for the recipe to
work, the target OS must be explicitly specified in the URL.

Recommended Procedure for Creating URL:
1. Go to the Epson site for your country.
2. Find the support page for your Epson device.
3. The support page will attempt to determine your current OS version and will display that
in a pop-up menu on the page. If that is OS you are targeting for deployment, temporarily
change the value in that popup menu to any other OS, wait a second (enough for the page to
quickly reload), and then change to the OS you are targeting for deployment. If you are
targeting a different OS, then directly change the OS in the popup menu.
4. Copy the URL.
5. Create an override of this recipe (or edit an existing override).
6. In the Input section, paste the URL that you copied earlier into the string for SEARCH_URL.
7. Check the URL you just pasted. Confirm that it ends with something that looks like
the following:
    ?review-filter=macOS+13.x
(substituting the number of the major macOS version as appropriate).
You can append this string if it is not present.

For example, the URL for the Epson Stylus Pro 3880 fetched from the Canadian Epson site with
macOS Ventura as the deployment OS is:

   https://epson.ca/Support/Printers/Professional-Imaging-Printers/Epson-Stylus-Pro-Series/Epson-Stylus-Pro-3880/s/SPT_CA61201-VM?review-filter=macOS+13.x

(The US URL is the same, except it is .com instead of .ca. Only the Canadian and US sites
have been tested.)

This recipe uses Epson's new code signing authority. Turn off code signature verification
if you require older installers.
</string>
	<key>Identifier</key>
	<string>com.github.jazzace.download.EpsonProDrivers</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Epson Stylus Pro</string>
		<key>SEARCH_URL</key>
		<string>https://www.epson.com/Support/override/this</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>data-dl_title="Printer Driver&amp;nbsp;v[\d.]+[\s\w="-;]+href="(https://ftp.epson.com/drivers/[\w].*\.dmg)"</string>
				<key>result_output_var_name</key>
				<string>url</string>
				<key>url</key>
				<string>%SEARCH_URL%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Seiko Epson Corporation (TXAEAV5RN4)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%/*.pkg</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
