<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the Epson SureColor P-series product driver from Epson's site.
These will generally be drivers and ICC profiles not included in the OS by Apple.
Make separate overrides for each printer you may want. An override is required.

When Epson was using separate code signing authorities for older and new products, it was
necessary to have separate recipes (EpsonProDrivers and EpsonSureColorDrivers). Now that
Epson is using the same authority for all new releases, this recipe has been turned into a stub
recipe that points to EpsonProDrivers.download.

If you are creating a new override, use the EpsonProDrivers series of recipes.
</string>
	<key>Identifier</key>
	<string>com.github.jazzace.download.EpsonSureColorDrivers</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Epson SureColor</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jazzace.download.EpsonProDrivers</string>
</dict>
</plist>
