<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of the Epson SureColor P-series product driver from Epson's site.
These will generally be drivers and ICC profiles not included in the OS by Apple.
Make separate overrides for each printer you may want. An override is required.

IMPORTANT:
This recipe requires that you find the support page for your product and copy that URL for 
use as the base string for the SEARCH_URL key in your override. In order for the recipe to 
work, the target OS must be explicitly specified in the URL.

Recommended Procedure for Creating URL:
1. Go to the Epson site for your country.
2. Find the support page for your Epson device.
3. The support page will attempt to determine your current OS version and will display that 
in a pop-up menu on the page. If that is OS you are targeting for deployment, temporarily 
change the value in that popup menu to any other OS, wait a second (enough for the page to 
quickly reload), and then change to the OS you are targeting for deployment. If you are 
targeting a different OS, then directly change the OS in the popup menu. 
4. Copy the URL.
5. Create an override of this recipe (or edit an existing override).
6. In the Input section, paste the URL that you copied earlier into the string for SEARCH_URL.
7. Check the URL you just pasted. Confirm that it ends with one of the following strings
(substituting the number of the OS as appropriate). You can append this string if it is not 
present. 

For macOS 10.12 and later:     ?review-filter=macOS+10.12.x
For OS X 10.11.x and earlier:  ?review-filter=Mac+OS+X+10.11.x

For example, the URL for the Epson SureColor P9000 fetched from the Canadian Epson site with 
macOS High Sierra as the deployment OS is:

	https://epson.ca/Support/Printers/Professional-Imaging-Printers/SureColor-Series/Epson-SureColor-P9000-Standard-Edition/s/SPT_SCP9000SE?review-filter=macOS+10.13.x
		
This recipe should grab the first link on the specified web page that is only a printer driver
(not a “combo package” or “recommended for you”).

This recipe is based on the EpsonProDrivers.download recipe in the same repo. This recipe is
necessary because of the change to the code signature being used. Should other products start
using this new developer identity, it can be used in place of EpsonProDrivers.download.

Known Limitation: This does not work on a page where the printer driver is not the first item listed
in the Drivers section of the web page. Currently, the recipe fails for the P600 page because of this.
</string>
    <key>Identifier</key>
    <string>com.github.jazzace.download.EpsonSureColorDrivers</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Epson SureColor</string>
        <key>SEARCH_URL</key>
        <string>https://www.epson.com/Support/override/this</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
       <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>"icc_drivers"([\s\w="]*-){1,}[\s\w="]*href="(?P&lt;url&gt;https://ftp.epson.com/drivers/[\w].*\.dmg)"</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/*.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Seiko Epson Corporation (TXAEAV5RN4)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>