<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the Epson Scanner Driver and Epson Scan Utility
from Epson's site, extracts the package from the dmg, and adds version information to the filename.
(The versioning assumes that Epson Scan 2 is part of the payload and is in the EpsonScan2_Standalone
component within the distribution pkg.)

Make separate overrides for each scanner driver you may want (make sure to change the
value of the NAME input key). An override is required.

See the parent (download) recipe for important recipe instructions. Requires the apizz-recipes repo.

Note: This recipe suppresses unnecessary copying of the package using the "StopProcessingIf" processor.
This means that any recipe that uses this as a parent recipe could stop execution before reaching the child.
You may need to remove the cache for the recipe in question and start again if you manually delete or move
the package that this recipe creates.
</string>
	<key>Identifier</key>
	<string>com.github.jazzace.pkg.EpsonScannerDriver</string>
	<key>Input</key>
	<dict/>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.apizz.download.EpsonScannerDriverandScanUtility-NewCert</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>download_changed == FALSE</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/scratch</string>
				<key>flat_pkg_path</key>
				<string>%pathname%/*.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/scratch/%NAME%</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/scratch/EpsonScan2_Standalone.pkg/payload</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/scratch/%NAME%/Applications/Epson Software/Epson Scan 2.app/Contents/Info.plist</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCopier</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>source_pkg</key>
				<string>%pathname%/*.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/scratch</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
