<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of the Epson product driver from Epson's site, 
extracts the package from the dmg, and copies it to a local path of your choosing.
These will generally be drivers for professional printers and the like not included in
the drivers supplied by Apple.
Make separate overrides for each device driver you may want. An override is required.

See the parent (download) recipe for important recipe instructions.

Note: This recipe suppresses unnecessary copying of the package using the "StopProcessingIf" processor. 
This means that any recipe that uses this as a parent recipe could stop execution before reaching the child. 
You may need to remove the cache for the recipe in question and start again if you manually delete or move 
the package that this recipe creates.

Note 2: Normally, we would use the related .pkg recipe as a parent and copy the file to our 
local repo, but the way in which AutoPkg evaluates variables means that we cannot have a .pkg 
recipe that copies the package to the AutoPkg cache or to a desired path using an input 
variable. So this recipe is identical to the .pkg version except that a destination 
path is included in the Input keys.</string>
	<key>Identifier</key>
	<string>com.github.jazzace.ds.EpsonProDrivers</string>
	<key>Input</key>
	<dict>
		<key>DS_NAME</key>
		<string>%NAME%</string>
		<key>DS_PKGS_PATH</key>
		<string>/Volumes/DSServer/Users/Shared/Deploy/Packages</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.jazzace.download.EpsonProDrivers</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>download_changed == FALSE</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%DS_PKGS_PATH%/%DS_NAME%.pkg</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%pathname%/*.pkg</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
