<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the Epson Scanner Driver and Epson Scan Utility
from Epson's site and extracts the package from the dmg.
Make separate overrides for each scanner driver you may want (make sure to change the
value of the NAME input key). An override is required.

See the parent (download) recipe for important recipe instructions. Requires the apizz-recipes repo.

Note: This recipe suppresses unnecessary copying of the package using the "StopProcessingIf" processor. 
This means that any recipe that uses this as a parent recipe could stop execution before reaching the child. 
You may need to remove the cache for the recipe in question and start again if you manually delete or move 
the package that this recipe creates.
</string>
	<key>Identifier</key>
	<string>com.github.jazzace.pkg.EpsonScannerDriver</string>
	<key>Input</key>
	<dict/>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.apizz.download.EpsonScannerDriverandScanUtility-NewCert</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>download_changed == FALSE</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%pathname%/*.pkg</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
