<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the most recent version of Ableton Live, creates an installer package,
and copies it to a local location of your choice, such as your DeployStudio repo.
Input keys:
- The LIVE_VERS (major version) and EDITION (e.g., studio, lite) are described in the parent download recipe.
- DS_PKGS_PATH is the path for the directory where you wish to place the copied package 
  (e.g., Packages folder in the DeployStudio repository). The path does not need to be on the same volume as the cache.
- DS_NAME is what the final package will be called when duplicated, regardless of what was generated by the parent recipe.
  It defaults to %NAME%.
</string>
    <key>Identifier</key>
    <string>com.github.jazzace.ds.AbletonLive</string>
    <key>Input</key>
    <dict>
        <key>DS_PKGS_PATH</key>
        <string>/Volumes/DSServer/Users/Shared/Deploy/Packages</string>
        <key>DS_NAME</key>
        <string>%NAME%</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jazzace.pkg.AbletonLive</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pkg_path%</string>
                <key>destination_path</key>
                <string>%DS_PKGS_PATH%/%DS_NAME%.pkg</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
    </array>
</dict>
</plist>