<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Based on a recipe by Tim Sutton for Version 9.</string>
	<key>Description</key>
	<string>Downloads the most recent version of Ableton Live based on the version and edition you specify.
LIVE_VERS is the major version of Live (9 or later).
Possible values for EDITION are: trial, lite, intro, standard, and suite.
This recipe now supports Ableton's various ARCHITECTURE options.
Valid options for Live 11 and later are "universal" and "intel"; earlier versions require "64".
</string>
	<key>Identifier</key>
	<string>com.github.jazzace.download.AbletonLive</string>
	<key>Input</key>
	<dict>
		<key>ARCHITECTURE</key>
		<string>universal</string>
		<key>EDITION</key>
		<string>lite</string>
		<key>LIVE_VERS</key>
		<string>11</string>
		<key>NAME</key>
		<string>Ableton Live 11 Lite</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>h2[^1-9]*(%LIVE_VERS%(\.\d+)+)</string>
				<key>result_output_var_name</key>
				<string>long_version</string>
				<key>url</key>
				<string>https://www.ableton.com/en/release-notes/live-%LIVE_VERS%/</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://cdn-downloads.ableton.com/channels/%long_version%/ableton_live_%EDITION%_%long_version%_%ARCHITECTURE%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/*.app</string>
				<key>requirement</key>
				<string>identifier "com.ableton.live" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = MWR434WD94</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
