<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Thanks to Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot) for the head start.</string>
	<key>Description</key>
	<string>Downloads the latest version of Astropad Standard for Mac.</string>
	<key>Identifier</key>
	<string>com.github.jazzace.download.AstropadStandard</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Astropad</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>SparkleUpdateInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>appcast_url</key>
				<string>https://s3.amazonaws.com/astropad.com/downloads/sparkle.xml</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Astropad.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.astro-hq.AstropadMac" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "8356ZZ8Y5K")</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
