<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Firefox disk image, builds a package that includes autoconfig resources 
(typically as generated via the CCK2 tool), and copies the package to a local path of your choosing.

Note: This recipe is no longer supported, as the CCK2 tool is no longer supported.
Firefox now supports configuration profiles for your customization and management needs.
Expect this recipe to be removed at a future date.

[Much of the following information comes from the two parent recipes. You need the main AutoPkg
 repo and gregneagle-recipes repo installed to run this recipe.]

Place the autoconfig.zip  in the same directory as the recipe. You may 
optionally use a different name by setting AUTOCONFIG_FILENAME via override.
Firefox 35 and later require an AUTOCONFIG_DIR of "Contents/Resources"; 
pre-34 requires "Content/MacOS". Firefox 34 is not supported. 

Local input keys:
- DS_PKGS_PATH is the destination path for the copy. A trailing slash is not required/desired.
  The path does not need to be on the same volume as the cache, as the pkg is being duplicated.
- DS_NAME is what the final package will be called, regardless of what was generated by the parent recipe.
  Use %NAME% for just the app name.

Other Input keys (available via override):
- Values for RELEASE correspond to directories here: http://download-origin.cdn.mozilla.net/pub/mozilla.org/firefox/releases/
Some useful values are: 'latest', 'latest-31.0esr', 'latest-esr', 'latest-3.6', 'latest-beta'
- LOCALE corresponds to directories at http://download-origin.cdn.mozilla.net/pub/mozilla.org/firefox/releases/$FIREFOX_BUILD/mac/
Examples include 'en-US', 'de', 'ja-JP-mac', 'sv-SE', and 'zh-TW'
No idea if all Firefox builds are available in all the same localizations, so you may need to verify that any particular
combination is offered.
- ORG_NAME is inserted into the pkg name to distinguish a vanilla "Firefox-35.0.pkg" from "Firefox_PretendCo-35.0.pkg", 
but will be overridden by DS_NAME when it gets copied to the local path of your choosing.
- You might consider setting a unique PKG_ID to differentiate your org's "flavour" of Firefox.
</string>
    <key>Identifier</key>
    <string>com.github.jazzace.ds.FirefoxAutoconfig</string>
    <key>Input</key>
    <dict>
        <key>DS_PKGS_PATH</key>
		<string>/Volumes/DSServer/Users/Shared/Deploy/Packages</string>
		<key>DS_NAME</key>
		<string>FirefoxAutoconfig</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>ParentRecipe</key>
    <string>com.github.gregneagle.pkg.FirefoxAutoconfig</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>This recipe is no longer supported. Expect it to be removed at a future date.</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>new_package_request == FALSE</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pkg_path%</string>
                <key>destination_path</key>
                <string>%DS_PKGS_PATH%/%DS_NAME%.pkg</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
    </array>
</dict>
</plist>
