<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Firefox, packages it, and copies the package to a local path of your choosing.
Input keys [Firefox pkg documentation taken from parent recipe]:
- Values for RELEASE correspond to directories here: http://download-origin.cdn.mozilla.net/pub/mozilla.org/firefox/releases/
Some useful values are: 'latest', 'latest-24.0esr', 'latest-esr', 'latest-3.6', 'latest-beta'
- LOCALE corresponds to directories at http://download-origin.cdn.mozilla.net/pub/mozilla.org/firefox/releases/$FIREFOX_BUILD/mac/
Examples include 'en-US', 'de', 'ja-JP-mac', 'sv-SE', and 'zh-TW'
No idea if all Firefox builds are available in all the same localizations, so you may need to verify that any particular
combination is offered.
- DS_PKGS_PATH is the destination path for the copy. A trailing slash is not required/desired.
  The path does not need to be on the same volume as the cache, as the pkg is being duplicated.
- DS_NAME is what the final package will be called, regardless of what was generated by the parent recipe.
  Use %NAME% for just the app name.
</string>
	<key>Identifier</key>
	<string>com.github.jazzace.ds.firefox-en_US</string>
	<key>Input</key>
	<dict>
		<key>DS_NAME</key>
		<string>FirefoxESR</string>
		<key>DS_PKGS_PATH</key>
		<string>/Volumes/DSServer/Users/Shared/Deploy/Packages</string>
		<key>LOCALE</key>
		<string>en_US</string>
		<key>RELEASE</key>
		<string>latest-esr</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.pkg.Firefox_EN</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>new_package_request == FALSE</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%DS_PKGS_PATH%/%DS_NAME%.pkg</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%pkg_path%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
