<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of Firefox, adds policies to the app bundle (policies.json), packages it, 
and then copies the package to a local path of your choosing.

This recipe requires:
- Firefox 60/60esr or later;
- A 'distribution' directory in the same directory as the recipe (usually RecipeOverrides) containing your policies.json file;
- The core Autopkg recipes; and
- neilmartin83-recipes.

Note that more recent versions of Firefox support configuration profiles, so you should consider that solution first.
This recipe is no longer supported for that reason.

Input keys:
- ORG_NAME is inserted into the pkg name to distinguish a vanilla "Firefox-60.0.pkg" from "Firefox_ORG_NAME-60.0.pkg".
- PKG_ID (optional) allows you to differentiate your org's "flavour" of Firefox from the default. Reverse domain order is common.
- DS_PKGS_PATH is the destination path for the copy. A trailing slash is not required/desired.
  The path does not need to be on the same volume as the cache, as the pkg is being duplicated.
- DS_NAME is what the final package will be called, regardless of what was generated by the parent recipe.
  It defaults to %NAME% (just the app name); use %NAME%_%ORG_NAME% if you like the customized name from the parent recipe
  but don't want the version number.
</string>
	<key>Identifier</key>
	<string>com.github.jazzace.ds.FirefoxPolicies</string>
	<key>Input</key>
	<dict>
		<key>DS_NAME</key>
		<string>%NAME%</string>
		<key>DS_PKGS_PATH</key>
		<string>/Volumes/DSServer/Users/Shared/Deploy/Packages</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.neilmartin83.pkg.FirefoxPolicies</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>This recipe is no longer supported. Expect it to be removed at a future date.</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>new_package_request == FALSE</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%DS_PKGS_PATH%/%DS_NAME%.pkg</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%pkg_path%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
