<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest copy of ClipGrab for Mac and makes a pkg installer from the app. Requires peshay-recipes.</string>
	<key>Identifier</key>
	<string>com.github.jazzace.pkg.ClipGrabMac</string>
	<key>Input</key>
	<dict/>
	<key>MiniumumVersion</key>
	<string>1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jazzace.download.ClipGrabMac</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
