<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest copy of ClipGrab for Mac and verifies the code signature. Requires peshay-recipes.</string>
	<key>Identifier</key>
	<string>com.github.jazzace.download.ClipGrabMac</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ClipGrab</string>
		<key>os</key>
		<string>dmg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.peshay.download.ClipGrab</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/*.app</string>
				<key>requirement</key>
				<string>identifier "de.clipgrab.ClipGrab" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = E8BJ3ZV5W8</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
