<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of LightWright (John McKernon Software), extracts the package, 
and then copies the package to the DeployStudio packages repository.
Input keys:
- DS_PKGS_PATH is the path for the Packages folder in the DeployStudio repository (trailing slash not required/desired).
  The path does not need to be on the same volume as the cache, as the pkg is being duplicated.
- DS_NAME is what the final package will be called in DeployStudio, regardless of what was generated by the parent recipe.
  It defaults to %NAME% (just the app name); use %pkgname% if you want the original package name (LW5MacInstaller.mpkg).
Note that the .pkg recipe has a StopProcessingIf processor to avoid redundant work if no update is present.
</string>
    <key>Identifier</key>
    <string>com.github.jazzace.ds.lightwright</string>
    <key>Input</key>
    <dict>
        <key>DS_PKGS_PATH</key>
        <string>/Volumes/DSServer/Users/Shared/Deploy/Packages</string>
        <key>DS_NAME</key>
        <string>%NAME%</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jazzace.pkg.lightwright</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/*.mpkg</string>
                <key>destination_path</key>
                <string>%DS_PKGS_PATH%/%DS_NAME%.mpkg</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
    </array>
</dict>
</plist>