<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads any Microsoft product that can be located using a Microsoft FWLink number.
Because this recipe is targeted at Mac products, the download is assumed to be a package (.pkg).

NOTE: This recipe fills a niche. Most people would be better off considering the recipes in the
main recipes repo or the rtrouton-recipes repo (supplemented for Munki by dataJAR-recipes).

This recipe is designed to be used with an override or child recipe.

The value of the FWLink number should be assigned to the input variable PRODUCTID in your override.
Here are a few FWLink values that may be useful:

525133 - Microsoft 365 for Mac/Office 2021/2019 for Mac
2009112 - Microsoft 365 BusinessPro Suite (with Teams)
869428 - Teams Standalone Installer
525134 - Word 2019/365

While you can find the FWLink value for a product in various places, a (manually-) complied source list 
can be found at macadmins.software (just look for the 6- or 7-digit number at the end of the appropriate link).

This recipe make no attempt to capture version information, but the filename should contain the version 
number (because Microsoft includes that in the package name). If you want to capture that as a variable, 
you could use the pkg recipes in the rtrouton-recipes repo as a model (or just use those recipes).
</string>
	<key>Identifier</key>
	<string>com.github.jazzace.download.microsoftmacproductfwlink</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MicrosoftProduct</string>
		<key>PRODUCTID</key>
		<string>2009112</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>prefetch_filename</key>
				<true/>
				<key>url</key>
				<string>https://go.microsoft.com/fwlink/?linkid=%PRODUCTID%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Microsoft Corporation (UBF8T346G9)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
