<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>This recipe downloads Blender (with the architecture specified by ARCHITECTURE), 
packages it, then uploads the pkg to your Jamf Pro Server/Distribution Point, 
creates/updates the related policy, and flushes the Policy Log to deploy it.

Because Blender has released separate installers for Intel and Apple Silicon, you will need
to override this recipe for each architecture you support.

The server/share details must be set using variables set in the environment or specified in your override
(see https://github.com/grahampugh/jamf-upload/wiki/JamfUploader-AutoPkg-Processors).

The grahampugh-recipes and hjuutilainen-recipes repos are required.

Note that the (Package) CATEGORY and PATCH_SOFTWARE_TITLE specified by the Input variables 
must each exist on the server, otherwise the recipe will fail.
</string>
	<key>Identifier</key>
	<string>com.github.jazzace.jamf.Blender-flush</string>
	<key>MinimumVersion</key>
	<string>2.0</string>
	<key>Input</key>
	<dict/>
	<key>ParentRecipe</key>
	<string>com.github.jazzace.jamf.Blender-latest</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyLogFlusher</string>
		</dict>
	</array>
</dict>
</plist>
