<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest PreRelease version of MeshLab and creates a package installer for the app.
Requires the hansen-m-recipes repo.</string>
	<key>Identifier</key>
	<string>com.github.jazzace.pkg.MeshLabPreRelease</string>
	<key>Input</key>
	<dict/>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jazzace.download.MeshLabPreRelease</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>version</key>
				<string/>
			</dict>
		</dict>
	</array>
</dict>
</plist>
