<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads MeshLab and creates a package installer for the app.
Requires that you have Matt Hansen's (hansen-m) and Jesse Peterson's (jessepeterson) recipes in your repo.</string>
	<key>Identifier</key>
	<string>com.github.jazzace.pkg.MeshLab</string>
	<key>Input</key>
	<dict/>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.hansen-m.download.MeshLab</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
        </dict>
	</array>
</dict>
</plist>
