<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads MeshLab and creates a package installer for the app.
Requires that you have homebysix-recipes in your repo (for the FindAndReplace processor).</string>
	<key>Identifier</key>
	<string>com.github.jazzace.pkg.MeshLabPreRelease</string>
	<key>Input</key>
	<dict/>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jazzace.download.MeshLabPreRelease</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.homebysix.FindAndReplace/FindAndReplace</string>
			<key>Arguments</key>
			<dict>
				<key>find</key>
				<string>Meshlab-</string>
				<key>input_string</key>
				<string>%version%</string>
				<key>replace</key>
				<string></string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
			<key>Arguments</key>
			<dict>
			    <key>version</key>
			    <string>%output_string%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
