<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest pre-release version of MeshLab for macOS.</string>
    <key>Identifier</key>
    <string>com.github.jazzace.download.MeshLabPreRelease</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MeshLab</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>github_repo</key>
				<string>cnr-isti-vclab/meshlab</string>
				<key>include_prereleases</key>
				<true/>
				<key>asset_regex</key>
				<string>MeshLab[\d.-].*macos.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
		    <key>Processor</key>
		    <string>CodeSignatureVerifier</string>
		    <key>Arguments</key>
		    <dict>
                <key>input_path</key>
                <string>%pathname%/*.app</string>
		        <key>requirement</key>
		        <string>identifier "com.vcg.meshlab" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UD5NTZR656</string>
		    </dict>
		</dict>
	</array>
</dict>
</plist>

