<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Processing 4.
Processing 4 offers an Intel and a Universal (which it calls Apple Silicon) app.
If you want the Intel-only app, change ARCHITECTURE to x64.</string>
	<key>Identifier</key>
	<string>com.github.jazzace.download.processing4</string>
	<key>Input</key>
	<dict>
		<key>ARCHITECTURE</key>
		<string>aarch64</string>
		<key>NAME</key>
		<string>Processing</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>.*macos-%ARCHITECTURE%\.zip$</string>
				<key>github_repo</key>
				<string>processing/processing4</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Processing.app</string>
				<key>requirement</key>
				<string>identifier "org.processing.app" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "6297K33652"</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
