<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string></string>
	<key>Identifier</key>
	<string>com.github.jazzace.pkg.vectorworkswithserverinfo</string>
	<key>Input</key>
	<dict>
		<key>WARNING_MESSAGE</key>
		<string>This recipe has been deprecated.  Please use the recipe in vmiller-recipes</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.4</string>
	<key>ParentRecipe</key>
	<string>com.github.vmiller.pkg.vectorworkswithserverinfo</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>%WARNING_MESSAGE%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
