<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of the major version of Vectorworks specified via Input Variable.
Note that this recipe only works for Vectorworks 2020 and later, as the code signature changed in the 
2020 version to add the version number.</string>
    <key>Identifier</key>
    <string>com.github.jazzace.download.vectorworks</string>
    <key>Input</key>
    <dict>
		<key>NAME</key>
		<string>Vectorworks</string>
		<key>MAJOR_VERSION</key>
		<string>2020</string>
        <key>DOWNLOAD_URL</key>
        <string>https://release.vectorworks.net/latest/Vectorworks/2020-NNA-eng-mac</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>prefetch_filename</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Vectorworks %MAJOR_VERSION% Installer.app</string>
                <key>requirement</key>
                <string>identifier "net.nemetschek.%MAJOR_VERSION%.vectorworksinstaller" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = LFNG3Q6WX2</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Vectorworks %MAJOR_VERSION% Installer.app/Contents/Resources/installer/Install Vectorworks%MAJOR_VERSION%.app</string>
                <key>requirement</key>
                <string>identifier "com.bitrock.appinstaller" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = LFNG3Q6WX2</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>