<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>This recipe downloads the latest Vectorworks Install Manager app (2025 or later) and creates a package that 
runs the Vectorworks Install Manager via shell script. This recipe differs from the VectorworksInstallManager.pkg 
recipe in that it aims to skip the initial Server dialogue box that appears when the user launches the app, 
providing the necessary settings in advance.

This recipe uses Vectorworks Install Manager’s capability to download the installer (.vwim) at runtime.

Input variables are used to specify which major version of Vectorworks you are installing (e.g., 2025) and 
to customize the installation package with the recipe user’s license information.
You must also specify the numerical values for the USER_ID and GROUP_ID to be used for the install.
The defaults are 0 and 80 respectively (root and admin).

The pkg is named with the NAME and the version number of Vectorworks Install Manager; if you want to include the year/major version 
in the pkg name, change the NAME variable accordingly.

This recipe also lets you set how you manage automatic updates. Set AUTO_UPDATES to 2 to turn auto updates off.
(The default set by Vectorworks is 0, which is Weekly. If you want Monthly, use 1.)

This requires that you supply as input variables:
• the Series (VW_SERIES, usually set to G),
• whether you want Vectorworks to AutoFind the server (AUTOFIND_SERVER, set to 0 or 1),
• the address of the server (AUTOFIND_SERVER, set to localhost if you chose to AutoFind,
  set to the IP address or DNS name of the server otherwise), and
• the identifier for the main module licensed (MAIN_MODULE, which will be designer for academic users).
This recipe creates a LoginDialog.xml file with your settings and leverages Outset (https://github.com/macadmins/outset)
to copy the file into the correct location in each user's account when they login.
There are no external file dependencies for this recipe; it creates all the files it needs during the recipe run.

Note: This recipe only works with Vectorworks 2025 (and later). Use VectorworksWithServer2024.pkg for Vectorworks 2023 or 2024.
</string>
	<key>Identifier</key>
	<string>com.github.jazzace.pkg.vectorworksinstallmgrwithserver</string>
	<key>Input</key>
	<dict>
		<key>AUTOFIND_SERVER</key>
		<string>1</string>
		<key>AUTO_UPDATES</key>
		<string>2</string>
		<key>BUNDLE_ID</key>
		<string>net.vectorworks.pkg.vectorworks%MAJOR_VERSION%andserverviainstallmanager</string>
		<key>GROUP_ID</key>
		<string>80</string>
		<key>MAIN_MODULE</key>
		<string>designer</string>
		<key>NAME</key>
		<string>Vectorworks Install Manager</string>
		<key>SERVER</key>
		<string>localhost</string>
		<key>USER_ID</key>
		<string>0</string>
		<key>VW_SERIAL_NO</key>
		<string>GFXXXX-123456-ABCDEF-G7HI89</string>
		<key>VW_SERIES</key>
		<string>G</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.4</string>
	<key>ParentRecipe</key>
	<string>com.github.jazzace.download.vectorworksinstallmanager</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/Unarchived/Vectorworks %MAJOR_VERSION% Install Manager.app/Contents/Info.plist</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>usr</key>
					<string>0755</string>
					<key>usr/local</key>
					<string>0755</string>
					<key>usr/local/outset</key>
					<string>0755</string>
					<key>usr/local/outset/files</key>
					<string>0755</string>
					<key>usr/local/outset/login-once</key>
					<string>0755</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileCreator</string>
			<key>Arguments</key>
			<dict>
				<key>file_content</key>
				<string>#!/bin/sh
# Establishes user settings for the login server (using LoginDialog.xml)
# to automate connection upon launching Vectorworks.
#
# Set variables (constants) for script run
vers="%MAJOR_VERSION%"
vwseries="%VW_SERIES%"
vwldpathroot="/usr/local/outset/files"
vwldtarget="$HOME/Library/Application Support/Vectorworks/${vers}/Settings/Series${vwseries}"
# Ensure the target folder for the settings exists
if ! [ -d "${vwldtarget}" ]
then
    mkdir -p "$HOME/Library/Application Support/Vectorworks/${vers}/Settings/Series${vwseries}"
fi
# Copy the XML settings file to the needed location in the user's account
cp "${vwldpathroot}/LoginDialog.xml" "$HOME/Library/Application Support/Vectorworks/${vers}/Settings/Series${vwseries}/"
</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_path</key>
				<string>%pkgroot%/usr/local/outset/login-once/vw%MAJOR_VERSION%_server_for_outset.sh</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileCreator</string>
			<key>Arguments</key>
			<dict>
				<key>file_content</key>
				<string>&lt;?xml version="1.0" encoding="UTF-8" standalone="no" ?&gt;
&lt;LoginDialog&gt;

  &lt;Days&gt;1&lt;/Days&gt;

  &lt;AutoFindServer&gt;%AUTOFIND_SERVER%&lt;/AutoFindServer&gt;

  &lt;AutoFindMaxTime&gt;1&lt;/AutoFindMaxTime&gt;

  &lt;DontShowAtStartup&gt;1&lt;/DontShowAtStartup&gt;

  &lt;Servers&gt;
    &lt;Server&gt;%SERVER%:5053&lt;/Server&gt;
  &lt;/Servers&gt;

  &lt;Modules&gt;
    &lt;MainModule&gt;%MAIN_MODULE%&lt;/MainModule&gt;
  &lt;/Modules&gt;

&lt;/LoginDialog&gt;
</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_path</key>
				<string>%pkgroot%/usr/local/outset/files/LoginDialog.xml</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/scripts</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileMover</string>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%RECIPE_CACHE_DIR%/Unarchived/Vectorworks %MAJOR_VERSION% Install Manager.app</string>
				<key>target</key>
				<string>%RECIPE_CACHE_DIR%/scripts/Vectorworks %MAJOR_VERSION% Install Manager.app</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileCreator</string>
			<key>Arguments</key>
			<dict>
				<key>file_content</key>
				<string>#!/bin/sh
# Installs Vectorworks using the Vectorworks Install Manager, which downloads the needed content at install time.
# The Vectorworks Install Manager is located in the same folder as the scripts.
#
# Set variables (constants) for script run
vers="%MAJOR_VERSION%"
vwipathroot="$(dirname $0)"
# Install Vectorworks by downloading on the fly
"${vwipathroot}/Vectorworks ${vers} Install Manager.app/Contents/Resources/cli.sh" install --installdir "/Applications/Vectorworks ${vers}" --serial %VW_SERIAL_NO% --uid %USER_ID% --gid %GROUP_ID%
# Check to verify app is in expected location; report error if not
if [ ! -e "/Applications/Vectorworks ${vers}/Vectorworks ${vers}.app" ]; then
    echo "Error in installing Vectorworks ${vers}" &gt;&gt; /var/log/vw_install.log
    exit 1
fi
</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/scripts/postinstall</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>mode</key>
							<string>0775</string>
							<key>path</key>
							<string>usr/local/outset/files/LoginDialog.xml</string>
							<key>user</key>
							<string>root</string>
						</dict>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>mode</key>
							<string>0755</string>
							<key>path</key>
							<string>usr/local/outset/login-once/vw%MAJOR_VERSION%_server_for_outset.sh</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>%BUNDLE_ID%</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/payload</string>
					<key>scripts</key>
					<string>%RECIPE_CACHE_DIR%/scripts</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/payload</string>
					<string>%RECIPE_CACHE_DIR%/scripts</string>
					<string>%RECIPE_CACHE_DIR%/Unarchived</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
