<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Vectorworks Install Manager for the major version specified via Input Variable.
Note that this recipe only works for Vectorworks 2025 and later (use Vectorworks2024.download for 2021-2024).</string>
	<key>Identifier</key>
	<string>com.github.jazzace.download.vectorworksinstallmanager</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://release.vectorworks.net/latest/Vectorworks/2025-NNA-eng-mac</string>
		<key>MAJOR_VERSION</key>
		<string>2025</string>
		<key>NAME</key>
		<string>Vectorworks</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>prefetch_filename</key>
				<true/>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Unarchived</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/Unarchived/Vectorworks %MAJOR_VERSION% Install Manager.app</string>
				<key>requirement</key>
				<string>identifier "net.vectorworks.%MAJOR_VERSION%.vectorworksinstallmanager" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = LFNG3Q6WX2</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>VectorworksUpdateDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>install_manager_path</key>
				<string>%RECIPE_CACHE_DIR%/Unarchived/Vectorworks %MAJOR_VERSION% Install Manager.app</string>
				<key>major_version</key>
				<string>%MAJOR_VERSION%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
