<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>This recipe downloads the latest Vectorworks installer app and creates a package that leverages the silent install 
CLI method to automate installation. Input variables are used to specify which major version of Vectorworks you are 
packaging (e.g., 2023) and to customize the installation package with the recipe user's license information. 
The pkg is named with the name and the version number (e.g., the installer for Vectorworks 2023 SP2 would be named 
"Vectorworks-28.0.2"); if you want to include the year/major version in the pkg name, change the NAME variable accordingly.
Should the download not have changed, no processing is done; this is done to save redundant copying of the 2+ GB installer.

Note: Due to a change in how the command line install (“silent install”) method works in Vectorworks 2023,
you should use the previous version of this recipe if you need to package Vectorworks 2021 or 2022.
If you need Vectorworks 2020, use the Vectorworks2020.pkg recipe.
</string>
	<key>Identifier</key>
	<string>com.github.jazzace.pkg.vectorworks</string>
	<key>Input</key>
	<dict>
		<key>VW_SERIAL_NO</key>
		<string>GFXXXX-123456-ABCDEF-G7HI89</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.4</string>
	<key>ParentRecipe</key>
	<string>com.github.jazzace.download.vectorworks</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>download_changed == FALSE</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>private</key>
					<string>0777</string>
					<key>private/tmp</key>
					<string>0777</string>
					<key>private/tmp/vw</key>
					<string>0777</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/private/tmp/vw/Vectorworks %MAJOR_VERSION% Installer.app</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%pathname%/Vectorworks %MAJOR_VERSION% Installer.app</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/scripts</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileCreator</string>
			<key>Arguments</key>
			<dict>
				<key>file_content</key>
				<string>#!/bin/sh
# Installs Vectorworks. Assumes installer is already available in the path specified by $vwipathroot.
# Installer will be deleted upon completion.
#
# Set variables (constants) for script run
vers="%MAJOR_VERSION%"
serialno="%VW_SERIAL_NO%"
vwipathroot="/private/tmp/vw"
# Install Vectorworks
"${vwipathroot}/Vectorworks ${vers} Installer.app/Contents/Resources/installer/Install Vectorworks${vers}.app/Contents/MacOS/installbuilder.sh" --mode unattended --unattendedmodeui none --Serial "${serialno}" --installdir "/Applications/Vectorworks ${vers}" --LDFChoice licenseID
# Check to verify app is in expected location; delete installer if app present
if [ -e "/Applications/Vectorworks ${vers}/Vectorworks ${vers}.app" ]
then
    rm -Rf "${vwipathroot}/Vectorworks ${vers} Installer.app"
    exit 0
else
    echo "Error in installing Vectorworks ${vers}; installer left in ${vwipathroot}" &gt;&gt; /var/log/vw_install.log
    exit 1
fi
</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/scripts/postinstall</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>mode</key>
							<string>0777</string>
							<key>path</key>
							<string>private/tmp/vw/</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>%bundleid%custom</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<key>scripts</key>
					<string>%RECIPE_CACHE_DIR%/scripts</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<string>%RECIPE_CACHE_DIR%/scripts</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
