<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.jamf.Redshift-latest</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Applications</string>
		<key>GROUP_NAME</key>
		<string>IAML Both Labs</string>
		<key>NAME</key>
		<string>Redshift</string>
		<key>POLICY_CATEGORY</key>
		<string>%CATEGORY%</string>
		<key>POLICY_NAME</key>
		<string>%SITE% %NAME% Latest</string>
		<key>POLICY_PREDICATE</key>
		<string>pkg_uploaded == False</string>
		<key>POLICY_TEMPLATE</key>
		<string>Policy-install-latest-site-group.xml</string>
		<key>SITE</key>
		<string>IAML</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.jazzace.jamf.Redshift-latest</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</key>
			<dict>
				<key>git_hash</key>
				<string>febfabb5d43579197a98dd738b85840321c2a369</string>
				<key>path</key>
				<string>/Volumes/AutoPkgLibrary/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py</string>
				<key>sha256_hash</key>
				<string>0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95</string>
			</dict>
			<key>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</key>
			<dict>
				<key>git_hash</key>
				<string>febfabb5d43579197a98dd738b85840321c2a369</string>
				<key>path</key>
				<string>/Volumes/AutoPkgLibrary/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPolicyUploader.py</string>
				<key>sha256_hash</key>
				<string>5d6715bfe85efbb3034ed36c27da2114742235232c0c156343fd70fc63d3d124</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.foigus.download.Redshift</key>
			<dict>
				<key>git_hash</key>
				<string>6810291a81a465c4730d35bfda37fd6cba01a9ff</string>
				<key>path</key>
				<string>/Volumes/AutoPkgLibrary/AutoPkg/RecipeRepos/com.github.autopkg.foigus-recipes/Maxon/RedshiftMetal.download.recipe</string>
				<key>sha256_hash</key>
				<string>b48ffe84e291f164ec638953a9ad5247b6746b6c78e302147602b7cb743a61f0</string>
			</dict>
			<key>com.github.jazzace.jamf.Redshift-latest</key>
			<dict>
				<key>path</key>
				<string>/Volumes/AutoPkgLibrary/AutoPkg/Testing/Redshift-latest.jamf.recipe</string>
				<key>sha256_hash</key>
				<string>fb2ba081b20a2e3b3629b6c6a2c12d2ea3a4bad25924c7e6de75779508c86c0c</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
